blog/_posts/2013-11/2013-11-1-vmware-use.html
---
layout: post
keywords: 
description: 
title: vmware使用问题
categories: [vmware]
tags: [vmware]
group: archive
icon: globe
featured: false
---

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 vmdk转qcow2</a></li>
<li><a href="#sec-2">2 vmware中ubuntu虚拟机增加磁盘</a></li>
<li><a href="#sec-3">3 windows下vmware合并多个vmdx</a></li>
<li><a href="#sec-4">4 VMWare安装Ubuntu 12.04开启虚拟机的Unity Mode模式</a>
<ul>
<li><a href="#sec-4-1">4.1 解决办法：安装gnome</a></li>
</ul>
</li>
<li><a href="#sec-5">5 ubuntu12.04.2卸载VMware</a>
<ul>
<li><a href="#sec-5-1">5.1 参考资料</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">vmdk转qcow2</h2>
<div class="outline-text-2" id="text-1">

<p>qemu-img convert -f vmdk VM.vmdk -O qcow2 VM.qcow2
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">vmware中ubuntu虚拟机增加磁盘</h2>
<div class="outline-text-2" id="text-2">

<p>本文主要介绍vmware为ubuntu虚拟机添加一块硬盘后，系统内挂载的过程。
</p>


<pre class="src src-sh">root@wchunx:~# fdisk -l
...
<span style="color: #7f7f7f;">#</span><span style="color: #7f7f7f;">&#28155;&#21152;&#30340;10G&#26032;&#30828;&#30424;&#65292;&#23578;&#26410;&#20998;&#21306;</span>
Disk /dev/sdc: 10.7 GB, 10737418240 bytes
255 heads, 63 sectors/track, 1305 cylinders, total 20971520 sectors
Units = sectors of 1 * 512 = 512 bytes
Sector size (logical/physical): 512 bytes / 512 bytes
I/O size (minimum/optimal): 512 bytes / 512 bytes
Disk identifier: 0x00000000

Disk /dev/sdc doesn<span style="color: #8b7355;">'t contain a valid partition table</span>

<span style="color: #8b7355;">root@wchunx:~# fdisk /dev/sdc</span>
<span style="color: #8b7355;">#&#36827;&#20837;&#30828;&#30424;&#25805;&#20316;&#30028;&#38754;</span>
<span style="color: #8b7355;">Command (m for help): n #&#26032;&#24314;&#20998;&#21306;</span>
<span style="color: #8b7355;">Partition type:</span>
<span style="color: #8b7355;">   p   primary (0 primary, 0 extended, 4 free)</span>
<span style="color: #8b7355;">   e   extended</span>
<span style="color: #8b7355;">Select (default p): p #&#36873;&#25321;&#20027;&#20998;&#21306;</span>
<span style="color: #8b7355;">Partition number (1-4, default 1): 1  #&#20998;&#21306;&#21495;&#20026;1</span>
<span style="color: #8b7355;">First sector (2048-20971519, default 2048): #&#26032;&#20998;&#21306;&#36215;&#22987;&#30340;&#30913;&#30424;&#22359;&#25968;&#65292;&#40664;&#35748;</span>
<span style="color: #8b7355;">Using default value 2048</span>
<span style="color: #8b7355;">Last sector, +sectors or +size{K,M,G} (2048-20971519, default 20971519): #&#20998;&#21306;&#22823;&#23567;&#65292;&#40664;&#35748;&#20351;&#29992;&#20840;&#37096;&#30828;&#30424;</span>
<span style="color: #8b7355;">Using default value 20971519</span>

<span style="color: #8b7355;">Command (m for help): p #&#25171;&#21360;&#35813;&#30913;&#30424;&#20998;&#21306;&#21015;&#34920;&#65292;&#26597;&#30475;&#21040;&#24050;&#32463;&#21019;&#24314;&#22909;&#30340;&#20998;&#21306;</span>

<span style="color: #8b7355;">Disk /dev/sdc: 10.7 GB, 10737418240 bytes</span>
<span style="color: #8b7355;">107 heads, 17 sectors/track, 11529 cylinders, total 20971520 sectors</span>
<span style="color: #8b7355;">Units = sectors of 1 * 512 = 512 bytes</span>
<span style="color: #8b7355;">Sector size (logical/physical): 512 bytes / 512 bytes</span>
<span style="color: #8b7355;">I/O size (minimum/optimal): 512 bytes / 512 bytes</span>
<span style="color: #8b7355;">Disk identifier: 0x1b2fb711</span>

<span style="color: #8b7355;">   Device Boot      Start         End      Blocks   Id  System</span>
<span style="color: #8b7355;">/dev/sdc1            2048    20971519    10484736   83  Linux</span>

<span style="color: #8b7355;">Command (m for help): w #&#20998;&#21306;&#20889;&#20837;&#30828;&#30424;</span>
<span style="color: #8b7355;">The partition table has been altered!</span>

<span style="color: #8b7355;">Calling ioctl() to re-read partition table.</span>
<span style="color: #8b7355;">Syncing disks.</span>

<span style="color: #8b7355;">root@wchunx:~# mkfs.ext4 /dev/sdc1 #&#26684;&#24335;&#21270;&#30828;&#30424;&#20026;ext4&#25991;&#20214;&#31995;&#32479;</span>
<span style="color: #8b7355;">mke2fs 1.42 (29-Nov-2011)</span>
<span style="color: #8b7355;">Filesystem label=</span>
<span style="color: #8b7355;">OS type: Linux</span>
<span style="color: #8b7355;">Block size=4096 (log=2)</span>
<span style="color: #8b7355;">Fragment size=4096 (log=2)</span>
<span style="color: #8b7355;">Stride=0 blocks, Stripe width=0 blocks</span>
<span style="color: #8b7355;">655360 inodes, 2621184 blocks</span>
<span style="color: #8b7355;">131059 blocks (5.00%) reserved for the super user</span>
<span style="color: #8b7355;">First data block=0</span>
<span style="color: #8b7355;">Maximum filesystem blocks=2684354560</span>
<span style="color: #8b7355;">80 block groups</span>
<span style="color: #8b7355;">32768 blocks per group, 32768 fragments per group</span>
<span style="color: #8b7355;">8192 inodes per group</span>
<span style="color: #8b7355;">Superblock backups stored on blocks:</span>
<span style="color: #8b7355;">    32768, 98304, 163840, 229376, 294912, 819200, 884736, 1605632</span>

<span style="color: #8b7355;">Allocating group tables: done                           </span>
<span style="color: #8b7355;">Writing inode tables: done                           </span>
<span style="color: #8b7355;">Creating journal (32768 blocks): done</span>
<span style="color: #8b7355;">Writing superblocks and filesystem accounting information: done</span>
<span style="color: #8b7355;">#&#36825;&#26102;fdisk -l&#23601;&#21487;&#20197;&#30475;&#21040;&#26032;&#24314;&#30340;&#20998;&#21306;</span>
<span style="color: #8b7355;">#&#32534;&#36753;/etc/fstab&#65292;&#20889;&#20837;/dev/sdc1   /data   ext4   defaults   0 0  &#23558;&#26032;&#20998;&#21306;&#25346;&#22312;&#21040;/data&#30446;&#24405;&#12290;</span>
<span style="color: #8b7355;">#&#37325;&#21551;&#21518;df -h&#21487;&#20197;&#30475;&#21040;&#25346;&#36733;&#30340;&#26032;&#20998;&#21306;</span>
</pre>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">windows下vmware合并多个vmdx</h2>
<div class="outline-text-2" id="text-3">

<p>合并多个vmdx为一个用到vmware-diskmanager.exe.位于vmware的安装目录。 <br/>
我的vmware-diskmanager.exe位于D:\Tools目录，虚拟机位于D:\Iso\vmware\SUSE Linux Enterprise 11 64-bit目录下，该目录下会有多个形如SUSE Linux Enterprise 11 64-bit-s001.vmdx带编号的vmdx文件，还会有一个SUSE Linux Enterprise 11 64-bit.vmdx不带编号的vmdx文件。
</p>
<p>
打开命令提示符
</p>


<pre class="src src-sh">D:\Iso\vmware\SUSE Linux Enterprise 11 64-bit&gt;D:\Tools\vmware-vdiskmanager.exe -
r <span style="color: #8b7355;">"SUSE Linux Enterprise 11 64-bit.vmdk"</span> -t 0 <span style="color: #8b7355;">"SUSE 11.vmdk"</span>
Creating disk <span style="color: #8b7355;">'SUSE 11.vmdk'</span>
  Convert: 100% done.
Virtual disk conversion successful.
</pre>

<p>
生成SUSE 11.vmdx。
</p></div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">VMWare安装Ubuntu 12.04开启虚拟机的Unity Mode模式</h2>
<div class="outline-text-2" id="text-4">

<p>主机操作系统是Windows 7 ,安装VMWare 9.0.2，虚拟机中运行Ubuntu 12.04 。当试图把VMWare切换到Unity Mode,我得到以下信息:
</p>
<p>
The virtual machine cannot enter Unity mode because: <br/>
</p><ul>
<li>Unity is not supported on the guest operating system.
</li>
</ul>


<p>
问题原因：VMWare和Ubuntu都有Unitiy，前者指的是Unity Mode，后者指的是Unity Shell。
</p>
</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">解决办法：安装gnome</h3>
<div class="outline-text-3" id="text-4-1">

<p>终端中输入：
</p>


<pre class="src src-sh">sudo add-apt-repository ppa:gnome3-team/gnome3
sudo apt-get update
sudo apt-get install gnome-shell
</pre>

<p>
更新完成后，注销，选择 Gnome Classic – No Effects桌面,进入系统即可。
</p></div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">ubuntu12.04.2卸载VMware</h2>
<div class="outline-text-2" id="text-5">

<p>在Ubuntu12.04.2上安装了VMware9.0.0后，总有问题。可能是9.0.0版本与3.5的内核有冲突。想要卸载
</p>
<p>
使用vmware-installer –uninstall-product vmware-workstation命令出现下面问题
</p>


<pre class="src src-sh">The vmware installer could not shut down all running virtual machines. if you have ACE VMs open, please shut them down or suspend them now and press &#8216;Retry&#8217; to continue.
</pre>

<p>
最后解决办法 rm /etc/rc{2,3,4,5}.d/*vmware*删除VMware的开机启动脚本，然后重启机器，再运行上面的卸载命令成功卸载。
</p>
<p>
安装VMware-workstation9.0.2没有问题
</p>
</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">参考资料</h3>
<div class="outline-text-3" id="text-5-1">

<p><a href="http://askubuntu.com/questions/155466/cant-uninstall-vmware-player-4-0-3">Can't uninstall Vmware player 4.0.3</a>
</p>
<p>
<a href="http://forum.ubuntu-fr.org/viewtopic.php?id=1078441">Workstation 9 crash depuis mise a jour Ubuntu</a>
</p></div>
</div>
</div>
